# Поменяйте мальчика и компьютер из прошлой задачи местами.
# Теперь мальчик загадывает число между 1 и 100 (включительно).
# Компьютер может спросить у мальчика:
# «Твое число равно, меньше или больше, чем число N?»,
# где N — число, которое хочет проверить компьютер.
# Мальчик отвечает одним из трёх чисел:
# 1 — равно,
# 2 — больше,
# 3 — меньше.
# Напишите программу, 
# которая с помощью цепочки таких вопросов и ответов мальчика угадывает число.
 
# Дополнительно: сделайте так, чтобы можно было гарантированно угадать число за семь попыток.

# Подсказка: используйте бинарный поиск, а не конкатенацию.
start = 1
end = 100
n = (start + end) // 2
print('Твое число равно, меньше или больше, чем число', str(n), '?')
trying = int(input('1 - равно, 2 - больше, 3 - меньше '))

while True:
  if trying == 1:
    break
    print('Поздравляю, компьютер угадал число! Твое число: ', n)
  elif trying == 2:
    start = n
    n = (start + end) // 2
    print('Твое число равно, меньше или больше, чем число', str(n), '?')
    trying = int(input('1 - равно, 2 - больше, 3 - меньше '))
  else:
    end = n
    n = (start + end) // 2
    print('Твое число равно, меньше или больше, чем число', str(n), '?')
    trying = int(input('1 - равно, 2 - больше, 3 - меньше '))