# В старину, когда даже в столице билеты в общественном транспорте выдавали контролёры,
# существовало поверье:
# если на билете сумма первых трёх цифр в номере билета равна сумме последних трёх,
# то это к удаче.
#
# Напишите программу,
# которая получала бы на входе шестизначный номер билета
# и выводила, счастливый это билет или нет.
# К примеру, билеты 666 666 и 252 135 — счастливые,
# а 123 456 — нет.

number = int(input('Введите номер билета: '))
repeat = 0
summ_right = 0
summ_left = 0

while repeat < 3:
  last_num = number % 10
  number // 10
  summ_right += last_num
  repeat += 1
  
repeat = 0
number = number // 1000 

while repeat < 3:
  last_num = number % 10
  number // 10
  summ_left += last_num
  repeat += 1

if summ_right == summ_left:
  print('Билет счастливый')
else:
  print('Билет не счастливый')