# Бухгалтер устала постоянно считать вручную среднегодовую зарплату сотрудников компании
# и, чтобы облегчить себе жизнь, обратилась к программисту.
 
# Напишите программу,
# которая принимает от пользователя зарплату сотрудника за каждый из 12 месяцев 
# и выводит на экран среднюю зарплату за год.

cash_sum = 0

for month in range (1, 13):
  print ('Сколько получил за', month, 'месяц?')
  cash = input('Зарплата: ')
  cash_sum += int(cash)
print (cash_sum / 12)