# Напишите программу,
# которая считывает с клавиатуры два числа a и b,
# считает и выводит на консоль 
#среднее арифметическое всех чисел из отрезка [a; b], которые кратны числу 3.

start = int(input('Введите начало отрезка: '))
end = int(input('Введите конец отрезка: '))
all = 0
summ = 0
for i in range (start, end+1):
  if i % 3 == 0:
    summ += i
    all += 1
print(summ/all)