#Напишите программу,
# которая находит и выводит все двузначные числа,
# которые равны утроенному произведению своих цифр.
# К таким относятся, например, 15 и 24

for number in range (10, 100):
  first = number % 10
  second = number // 10
  if number == first * second * 3:
    print (number)