# У нас есть
# квадратный конверт размера 12х12 сантиметров и письмо на квадратном листе бумаги,
# которое не помещается в конверт.
# 
# Напишите программу,
# которая подскажет сколько раз нужно сложить письмо пополам,
# чтобы оно поместилось в конверт.
# Размеры письма вводятся с клавиатуры.
print('Размер конверта: 12х12')
size_letter = int(input('Введите ширину письма: '))
fold = 0
while size_letter > 12:
  size_letter /= 2
  fold += 1
print('Письмо необходимо сложить', fold * 2, 'раз')