#Ежемесячная стипендия студента составляет educational_grant руб.,
# а расходы на проживание превышают стипендию и составляют expenses руб. в месяц.
# Рост цен ежемесячно увеличивает расходы на 3%, кроме первого месяца.
# 
# Составьте программу расчета суммы денег,
# которую необходимо получить у родителей один раз в начале обучения,
# чтобы можно было прожить учебный год (10 месяцев), используя только эти деньги и стипендию.
educational_grant = int(input('Введите размер стипендии: '))
expenses = int(input('Введите размер расходов: '))

parents_cash = expenses - educational_grant
for month in range(2, 11):
  expenses *= 1.03
  parents_cash += expenses - educational_grant
print('Надо денег от родителей: ', -parents_cash)