#Напишите программу, 
# которая считывает с клавиатуры два числа a и b,
# считает и выводит на консоль среднее арифметическое
# всех чисел из отрезка [a; b], которые кратны числу c.
# Подсказка: (a и b  являются промежутком, а c для проверки кратности).
start = int(input('Введите начало отрезка: '))
stop = int(input('Введите конец отрезка: '))
multiple = 0
summ_numbers = 0
for number in range(start, stop + 1, 1):
  multiple += 1
  summ_numbers += number
print('Среднее арифметическое чисел на указанном отрезке равно', summ_numbers/multiple)