# Дано натуральное число N.
# Напишите программу для вычисления следующей суммы ряда (начиная с единицы)
# S = 1 - 1/2 + 1/4 - 1/8 + (-1)**N * 1/2**N

N = int(input('Да какого натурального числа вывести сумму? '))
summ = 0
for degree in range(0, N + 1):
  summ += (-1) ** degree * 1 / 2 ** degree
print('Сумма ряда равна', summ)