# Два сотрудника спецслужб переписываются необычным шифром.
# Каждую букву они шифруют в виде строки,
# внутри которой есть длинная последовательность букв “s”, 
# а длина самой длинной - это и есть номер буквы алфавита, которую хотят отправить.
# 
# Напишите программу,
# которая получает на вход строку,
# подсчитывает в ней самую длинную последовательность подряд идущих букв “s” и выводит ответ на экран.
# 
# Пример:
# Введите строку: ssbbbsssbc
# Самая длинная последовательность: 3

text = input('Введите текст: ')
letter_count = 0
max_letter_count = 0

for letter in text:
  if letter == 's':
    letter_count += 1
    if letter_count > max_letter_count:
      max_letter_count = letter_count
  else:
    letter_count = 0
print(f'Самая длинная последовательность: {max_letter_count}')