#Старому капитану необходимо пополнить команду.
# Но попадут на его корабль только достойные! 
# Он отобрал 10 человек и те, кто из них крикнет слово “Карамба”, попадут на борт.
# 
# Пользователь вводит 10 слов. 
# 
# Напишите программу,
# которая определяет, сколько из них совпадают со словом “Карамба”.
summ = 0
for caramba in range(10):
  text = input('Введите текст: ')
  if text == 'Карамба':
    summ += 1
print(f'На борт попадет {summ} человек(а)')